//-----------------------------------------------------------------------------
//  使用时请保留该信息，非常感谢
//-----------------------------------------------------------------------------
//  角色设定生成器
//  Character Generator
//
//  作者：熊豆(kumame)
//  站点：https://github.com/kumame/Tools
//-----------------------------------------------------------------------------

//数据版本，至少比当前版本+1，用于更新浏览器本地储存的数据。
DBversion = 1 ;

//坐标图片
var mapimg = new Array();
    //左侧
    mapimg[1] = 'app/agerf.png';
    //右侧
    mapimg[2] = 'app/map.png';

//坐标图片尺寸
var mapsize=250;

//坐标阈值，影响选中点的范围容差，不建议过大也不建议小于5
//虚实、年代
var RFYZ = 5;
//地区
var ZBYZ = 10;

//默认角色名
var Cname = 'TA';

//种族模块开关:1=开，0=关
var RACE = 1;
//混血概率，0 为关闭
var hybrid = 70;
//允许混血的RF(虚实)界限
var hybridRF = 60;
//允许混血的基底种族在数据库的位置
var Embryo = 1;

//身高(cm)以热带区域身高作为参考，会根据两极纬度进行计算，越接近寒冷地区越高
var heightMIN= 110;
var heightMAX= 160;
//热带 位于数据库位置
var REDAI = 3;

//异色瞳概率，根据RF坐标增加，0为关闭
var EYCL123 = 0.4;

//发色渐变、挑染概率，（Age,RF）根据Age减少或根据RF坐标增加，0为关闭
var H_B_CG= new Array(3,0.5) ;

//雀斑概率
var F_B_F =10;
//胡须概率
var F_B_B =10;
//面部痣出现概率
var F_B_M =20;
//面部伤痕出现概率
var F_B_S=5;
//躯干伤痕出现概率
var F_B_BS=5;
//四肢残疾概率
var B_L_D=3;



//坐标转换比例，谨慎修改
var BSZH = mapsize/100;
